testsrc/main/mondrian/xmla/basic/EXECUTE_Slicer_in.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
        <Command>
        <Statement>
SELECT {[Customers].Children} ON 0,
{[Gender].Children} ON 1
FROM Sales
WHERE ([Time].[1997].[Q2], [Marital Status], [Measures].[Store Sales])
         </Statement>
        </Command>
        <Properties>
          <PropertyList>
            <Catalog>${catalog}</Catalog>
            <DataSourceInfo>${data.source.info}</DataSourceInfo>
            <Format>${format}</Format>
            <AxisFormat>TupleFormat</AxisFormat>
          </PropertyList>
        </Properties>
</Execute>
</soapenv:Body>
</soapenv:Envelope>
